#Importando as bibliotecas necessárias

In [1]:
import numpy as np
import pandas as pd
import matplotlib as plot

Importando o banco de dados

In [4]:
df = pd.read_csv("Questão 1 - Base.txt ", delim_whitespace = True)

In [5]:
df.head()

   ID_CONTA DT_VENCIMENTO DS_ROLAGEM  VL_FATURA
0    402467    2019-01-01        FX0     210.00
1    403001    2019-01-01        FX1    1097.18
2    403499    2019-01-01        FX0    1209.88
3    403670    2019-01-01        FX0     667.40
4    404183    2019-01-01        FX1    1239.52

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2728249 entries, 0 to 2728248
Data columns (total 4 columns):
 #   Column         Dtype
---  ------         -----
 0   ID_CONTA       int64
 1   DT_VENCIMENTO  object
 2   DS_ROLAGEM     object
 3   VL_FATURA      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 83.3+ MB

In [8]:
df.describe()

           ID_CONTA     VL_FATURA
count  2.728249e+06  2.728249e+06
mean   1.263072e+06  5.043950e+02
std    3.695060e+05  5.166548e+02
min    2.763700e+04  3.000000e+01
25%    1.040601e+06  1.747500e+02
50%    1.375717e+06  3.541100e+02
75%    1.562847e+06  6.506900e+02
max    1.752194e+06  2.264748e+04

In [9]:
df.describe(include='O')

       DT_VENCIMENTO DS_ROLAGEM
count        2728249    2728249
unique            97          2
top       2019-01-10        FX0
freq           55900    2481796

In [10]:
df = pd.get_dummies(df,columns=['DS_ROLAGEM'],drop_first=True)

In [11]:
df

         ID_CONTA DT_VENCIMENTO  VL_FATURA  DS_ROLAGEM_FX1
0          402467    2019-01-01     210.00               0
1          403001    2019-01-01    1097.18               1
2          403499    2019-01-01    1209.88               0
3          403670    2019-01-01     667.40               0
4          404183    2019-01-01    1239.52               1
...           ...           ...        ...             ...
2728244   1624841    2019-08-08    1467.05               1
2728245   1624848    2019-08-08    1189.15               0
2728246   1624871    2019-08-08     427.72               1
2728247   1624878    2019-08-08     281.14               0
2728248   1624884    2019-08-08     313.00               0

[2728249 rows x 4 columns]

1.1 – Qual o percentual de faturas emitidas por mês no qual os clientes não pagaram a fatura anterior?